appcleaner
cakebrew
copyclip
dash
docker-beta
evernote
filezilla
firefox
flux
gitkraken
google-chrome
google-drive-file-stream
iterm2
java
macdown
mysqlworkbench
phpstorm
postman
soapui
spectacle
station
sublime-text
virtualbox
visual-studio-code
vlc
winds