appcleaner
cakebrew
copyclip
discord
docker-edge
font-meslo-for-powerline
google-chrome-beta
google-drive-file-stream
iterm2-beta
java
jetbrains-toolbox
pock
postman
soapui
spectacle
screenflow
slack-beta
sublime-text
termius
virtualbox
visual-studio-code
vlc
winds
