appcleaner
cakebrew
copyclip
google-chrome
google-drive-file-stream
iterm2
java
jetbrains-toolbox
pock
postman
soapui
spectacle
screenflow
spark
station
sublime-text
terminus
virtualbox
visual-studio-code
vlc
winds
